In [1]:
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [2]:
import pandas as pd

In [21]:
df = pd.read_csv('https://api.statbank.dk/v1/data/FOLK1A/CSV?delimiter=Semicolon&Tid=2020K3%2C2008K3&CIVILSTAND=G%2CF&ALDER=IALT&OMR%C3%85DE=000&K%C3%98N=TOT', sep=';')

In [22]:
df.head()

      TID      CIVILSTAND  ALDER       OMRÅDE    KØN  INDHOLD
0  2008K3  Gift/separeret  I alt  Hele landet  I alt  2176196
1  2008K3        Fraskilt  I alt  Hele landet  I alt   432713
2  2020K3  Gift/separeret  I alt  Hele landet  I alt  2132092
3  2020K3        Fraskilt  I alt  Hele landet  I alt   550715

In [23]:
df_filtered = df[df['CIVILSTAND'].isin(['Fraskilt'])]

In [24]:
df_filtered.head()

      TID CIVILSTAND  ALDER       OMRÅDE    KØN  INDHOLD
1  2008K3   Fraskilt  I alt  Hele landet  I alt   432713
3  2020K3   Fraskilt  I alt  Hele landet  I alt   550715

In [25]:
del df_filtered['ALDER']

In [28]:
del df_filtered['OMRÅDE']

In [26]:
del df_filtered['KØN']

In [29]:
df_filtered.head()

      TID CIVILSTAND  INDHOLD
1  2008K3   Fraskilt   432713
3  2020K3   Fraskilt   550715

In [34]:
df.groupby('TID')['INDHOLD'].sum().reset_index()

      TID  INDHOLD
0  2008K3  2608909
1  2020K3  2682807

In [31]:
df.head()

      TID      CIVILSTAND  ALDER       OMRÅDE    KØN  INDHOLD
0  2008K3  Gift/separeret  I alt  Hele landet  I alt  2176196
1  2008K3        Fraskilt  I alt  Hele landet  I alt   432713
2  2020K3  Gift/separeret  I alt  Hele landet  I alt  2132092
3  2020K3        Fraskilt  I alt  Hele landet  I alt   550715

In [36]:
df['Procent'] = df['INDHOLD']/5500000 * 100

In [ ]:
'''Jeg forsøgte at lave en procent kolonne på Danmarks befolkning mod civilstand, men den er ikke præcis da Danmarks befolkning er steget med 200.000'''

In [37]:
df.head() #Min besvaring på 5A, fraskilte er steget med 2,2%

      TID      CIVILSTAND  ALDER       OMRÅDE    KØN  INDHOLD    Procent
0  2008K3  Gift/separeret  I alt  Hele landet  I alt  2176196  39.567200
1  2008K3        Fraskilt  I alt  Hele landet  I alt   432713   7.867509
2  2020K3  Gift/separeret  I alt  Hele landet  I alt  2132092  38.765309
3  2020K3        Fraskilt  I alt  Hele landet  I alt   550715  10.013000

In [38]:
ugifte_total_2020 = pd.read_csv('https://api.statbank.dk/v1/data/FOLK1A/CSV?delimiter=Semicolon&CIVILSTAND=U%2CTOT&OMR%C3%85DE=101%2C147%2C151%2C157%2C159&Tid=2020K4', sep=';')

In [40]:
ugifte_total_2020

  CIVILSTAND         OMRÅDE     TID  INDHOLD
0      Ugift      København  2020K4   417782
1      Ugift  Frederiksberg  2020K4    61020
2      Ugift       Ballerup  2020K4    22707
3      Ugift       Gentofte  2020K4    35017
4      Ugift       Gladsaxe  2020K4    34749
5      I alt      København  2020K4   637936
6      I alt  Frederiksberg  2020K4   104351
7      I alt       Ballerup  2020K4    48978
8      I alt       Gentofte  2020K4    74623
9      I alt       Gladsaxe  2020K4    69203